# ການສ້າງ tuple ສາມາດເຮັດໄດ້ງ່າຍພຽງແຕ່ໃຊ້ເຄື່ອງໝາຍວົງເລັບ ()
# ແຕ່ຕ້ອງລະມັດລະວັງໃນກໍ່ລະນີ້ທີ່ຕ້ອງການສ້າງ tuple ແຕ່ມີສະມາຊິກພຽງແຕ່ໂຕດຽວ

x = ("python for everyone") # ທຳການສ້າງໂຕແປ ໂດຍມີສະມາຊິກຕົວດຽວ
# ເມື່ອເຮົາໃຊ້ຄຳສັ່ງ type ເພື່ອກວດສອບວ່າຊະນິດຂໍ້ມູນຂອງໂຕແປແມ່ນຫຍັງ
print(type(x))
# ຜົນລັບກໍ່ຈະເປັນ <class 'str'>

# ສະນັ້ນເມື່ອຕ້ອງການສ້າງ tuple ໂດຍໃຫ້ມີສະແດງໂຕດຽວໄວ້ກ່ອນສາມາດເຮັດໄດ້ດັ່ງນີ້
x = ("python for everyone",) # ຂັ້ນດ້ວຍເຄື່ອງໝາຍຈຸດ ,
print(type(x))
# ຜົນລັບກໍ່ຈະເປັນ <class 'tuple'>