'''
Tuple ອ່ານວ່າ (ທູບໂປ ຫຼື ທັບໂປ) ເປັນໂຄງສ້າງຂໍ້ມູນແບບ non-primitive ມີລັກສະນະຄືກັນກັບ list
ຄືຈະເກັບຂໍ້ມູນແບບເປັນກຸ່ມ ເຊີ່ງຂໍ້ມູນຂ້າງໃນຈະເອີ້ນວ່າ ສະມາຊິກ ເຊີ່ງສາມາດຈັດກັບໄດ້ຫຼາຍໆ ປະເພດຂໍ້ມູນຮ່ວມກັນ
ແຕ່ຂໍ້ແຕກຕ່າງຈາກ list ກໍ່ຄືຂໍ້ມູນສະມາຊິກຈະບໍ່ສາມາດປ່ຽນແປງໄດ້ (unchangeable)
ສາມາດນຳໄປໃຊ້ຈັດເກັບຂໍ້ມູນຈຳພວກ ID, ລະຫັດບັດປະຊາຊົນ, ຂໍ້ມູນຄ່າຄົງທີ ເປັນຕົ້ນ
'''
# ການສ້າງ tuple ແມ່ນຈະໃຊ້ເຄື່ອງໝາຍ () ໃນການກຳນົດຂອບເຂດ
number = () # tuple ວ່າງເປົ່າ
number = (10,20,30,40)      # ເກັບສະເພາະ int
name = ("John", "Chiele", "Mike", "Kole", "Doley")  # ເກັບສະເພາະ str
etc = (1,"Max",3.25,True,-20)   # ເກັບຫຼາຍໆ ຊະນິດຂໍ້ມູນນຳກັນ

# ໃນການກວດສອບສະນິດຂໍ້ມູນສາມາດໃຊ້ຄຳສັ່ງ type 
print(type(number))

# ການສ້າງໂຕແປແບບ constructure ກໍ່ສາມາດເຮັດໄດ້ດັ່ງນີ້
numb = tuple((10,20,30,40)) 

# ໃນການແກ້ໄຂຂໍ້ມູນໃນ tuple ຈະບໍ່ສາມາດແກ້ໄຂໄດ້ຫຼັງຈາກທີ່ເຮົາສ້າງ tuple ມາແລ້ວ
number[0] = 50  # ປ່ຽນສະມາຊິກຂອງ number ຕຳແໜ່ງທຳອີດເປັນ 50
# ຜົນລັບກໍ່ຈະຂື້ນວ່າ TypeError: 'tuple' object does not support item assignment
