# tuple ກ່ອນແກ້ໄຂ
name = ("John", "Chiele", "Mike", "Kole", "Doley")
print("ກ່ອນແກ້ໄຂ : ", name)     # ສະແດງສະມາຊິກກ່ອນແກ້ໄຂ

# ການແກ້ໄຂຂໍ້ມູນຂອງ tuple ແມ່ນບໍ່ສາມາດເຮັດໄດ້
# ເຖິງຢ່າງໃດກໍ່ຕາມເຮົາສາມາດປະຍຸກວິທີການເພື່ອແກ້ໄຂບັນຫານີ້ໄດ້ດ້ວຍການປ່ຽນປະເພດຂໍ້ມູນຈາກ tuple ເປັນ list
# ແລ້ວທຳການແກ້ໄຂຂໍ້ມູນທີ່ຕ້ອງການ ບໍ່ວ່າຈະເປັນການເພີ່ມ, ລົບຂໍ້ມູນ ຫຼື ຈັດລຽນຂໍ້ມູນ

# ສ້າງ list ແລະ ດືງຂໍ້ມູນຈາກ tuple ມາໃສ່
namelist = list(name)

# ທຳການແກ້ໄຂ list
namelist[2] = "Luvs"

# ປ່ຽນ list ກັບມາເປັນ tuple ອີກຄັ້ງໂດຍການດືງຂໍ້ມູນຈາກ list ມາໃສ່ tuple
name = tuple(namelist)
print("ຫຼັງແກ້ໄຂ : ", name)     # ສະແດງສະມາຊິກຫຼັງຈາກແກ້ໄຂແລ້ວ

