name = ["John", "Chiele", "Mike", "Kole", "Doley"]

# ການແກ້ໄຂຂໍ້ມູນແມ່ນ ການທີ່ເຮົາຕ້ອງການປ່ຽນແປງຂໍ້ມູນຂອງສະມາຊິກໃນ list ໃຫ້ເປັນຂໍ້ມູນໃໝ່ 
# ສາມາດເຮັດໄດ້ໂດຍການລະບຸຕຳແໜ່ງຂອງສະມາຊິກທີ່ຕ້ອງການແກ້ໄຂໄດ້ທັນທີ

# ວິທີການແກ້ໄຂ  :  ຊື່ໂຕແປ [index] = ຂໍ້ມູນທີ່ແກ້ໄຂ

print("ກ່ອນແກ້ໄຂ : ", name)   # ເພື່ອກວດສອບວ່າສະມາຊິກດັ່ງເດີມຂອງ list ມີໂຕໃດແນ່
name[2] = "Luvs"            # ທຳການແກ້ໄຂ, ຖ້າສະມາຊິກມີຂໍ້ມູນເປັນ str ໃຫ້ລະບຸໃສ່ໃນເຄື່ອງໝາຍ " "
print("ຫຼັງແກ້ໄຂ : ", name)    # ກວດສອບຫຼັງຈາກແກ້ໄຂສະມາຊິກແລ້ວ