# ຕົວຢ່າງ 1: ຮັບ ແລະ ຈັດລຽນລຳດັບຂໍ້ມູນຕົວເລກ

number=[]                               # ສ້າງ list ເປົ່າຂື້ນມາໄວ້ເກັບຂໍ້ມູນ
while True:                             # ທຳການວົນຮອບເມື່ອເງື່ອນໄຂຖືກຕ້ອງ
    x=int(input("ປ້ອນຕົວເລກຂອງທ່ານ :"))    # ຮັບຂໍ້ມູນຈາກແປ້ນພິມໂດຍຂໍ້ມູນຈະແປງເປັນ integer
    if x<0:                             # ຖ້າຫາກປ້ອນຄ່າທີ່ຕ່ຳກວ່າ 0
        break                           # ຢຸດການທຳງານຂອງ loop
    number.append(x)                    # ໃຫ້ທຳການຮັບຕົວເລກທີ່ປ້ອນເຂົ້າມາເພື່ອໃສ່ຕຳແໜ່ງສຸດທ້າຍຂອງ list 

print("ກ່ອນລຽນ =>",number)               # ສະແດງຕົວເລກທີ່ປ້ອນເຂົ້າມາໃນຮູບແບບປົກກະຕິ
number.sort()                           # ຈັດລຽນຕົວເລກທີ່ປ້ອນເຂົ້າມາແບບໜ້ອຍຫາຫຼາຍ
print("ຕົວເລກໜ້ອຍຫາຫຼາຍ=>",number)
number.reverse()                        # ຈັດລຽນຕົວເລກທີ່ປ້ອນເຂົ້າມາແບບຫຼາຍຫາໜ້ອຍ
print("ຕົວເລກຫຼາຍຫາໜ້ອຍ=>",number)
print("ຈົບໂປຣແກຣມ")