# ຕົວຢ່າງ 4: ຈັດລຽນລຳດັບຊື່
student=[]                              # ສ້າງ list ເປົ່າຂື້ນມາໄວ້ເກັບຂໍ້ມູນ
while True:                             # ທຳການວົນຮອບເມື່ອເງື່ອນໄຂຖືກຕ້ອງ
    x=input("ປ້ອນຊື່ຂອງນັກຮຽນ :")           # ຮັບຂໍ້ມູນຈາກແປ້ນພິມ
    if x == "stop":                     # ຖ້າຫາກປ້ອນຄຳວ່າ stop
        break                           # ຢຸດການທຳງານຂອງ loop
    student.append(x)                   # ໃຫ້ທຳການຮັບຊື່ທີ່ປ້ອນເຂົ້າມາເພື່ອໃສ່ຕຳແໜ່ງສຸດທ້າຍຂອງ list 

print(student)                          # ສະແດງຊື່ທີ່ປ້ອນເຂົ້າມາໃນຮູບແບບປົກກະຕິ
student.sort()                          # ຈັດລຽນຊື່ທີ່ປ້ອນເຂົ້າມາແບບໜ້ອຍຫາຫຼາຍ (a-z, ກ-ຮ)
print(student)
student.reverse()                       # ຈັດລຽນຊື່ທີ່ປ້ອນເຂົ້າມາແບບຫຼາຍຫາໜ້ອຍ (z-a, ຮ-ກ)
print(student)