# ຕົວຢ່າງ 3: ຊອກຫາເລກຄູ່, ເລກຄິກ
number=[]                               # ສ້າງ list ເປົ່າຂື້ນມາໄວ້ເກັບຂໍ້ມູນທີ່ປ້ອນຜ່ານແປ້ນພິມ
odd=[]                                  # ສ້າງ list ເປົ່າຂື້ນມາໄວ້ເກັບຂໍ້ມູນເລກຄູ່
even=[]                                 # ສ້າງ list ເປົ່າຂື້ນມາໄວ້ເກັບຂໍ້ມູນເລກຄິກ
while True:                             # ທຳການວົນຮອບເມື່ອເງື່ອນໄຂຖືກຕ້ອງ
    x=int(input("ປ້ອນຕົວເລກຂອງທ່ານ :"))    # ຮັບຂໍ້ມູນຈາກແປ້ນພິມໂດຍຂໍ້ມູນຈະແປງເປັນ integer
    if x<0:                             # ຖ້າຫາກປ້ອນຄ່າທີ່ຕ່ຳກວ່າ 0
        break                           # ໃຫ້ຢຸດການທຳງານຂອງ loop
    if x%2 == 0:                        # ຖ້າຂໍ້ມູນທີ່ປ້ອນເຂົ້າມາຫາກຫານຂາດໃຫ້ 2 ຫຼື ຫານໄດ້ 2 ແລ້ວໄດ້ 0
        even.append(x)                  # ໃຫ້ທຳການຮັບຕົວເລກທີ່ປ້ອນເຂົ້າມານັ້ນເພື່ອໃສ່ຕຳແໜ່ງສຸດທ້າຍຂອງ list ທີ່ເປັນເລກຄູ່
    else :                              # ຫຼື ຖ້າບໍ່ແມ່ນ
        odd.append(x)                   # ໃຫ້ທຳການຮັບຕົວເລກທີ່ປ້ອນເຂົ້າມານັ້ນເພື່ອໃສ່ຕຳແໜ່ງສຸດທ້າຍຂອງ list ທີ່ເປັນເລກຄິກ
    number.append(x)                    # ໃຫ້ທຳການຮັບຕົວເລກທີ່ປ້ອນເຂົ້າມາເພື່ອໃສ່ຕຳແໜ່ງສຸດທ້າຍຂອງ list

print("ຕົວເລກທັງໝົດ =>" ,number)
print("ເລກຄູ່ => ",even)
print("ເລກຄິກ => ",odd)