'''
ການເພີ່ມສະມາຊິກເຂົ້າໄປໃນ list ສາມາດເຮັດໄດ້ 2 ແບບຄື:
1. ການໃຊ້ append ເປັນການເພີ່ມສະມາຊິກໃນຕຳແໜ່ງສຸດທ້າຍ
2. ການໃຊ້ insert ເປັນການເພີ່ມ ຫຼື ແຊກສະມາຊິກໃນຕຳແໜ່ງໃດກໍ່ໄດ້ໃນ list ທີ່ເຮົາຕ້ອງການ
'''

# list ຕັ້ງຕົ້ນ
phone = ["Samsung","Apple","Huawei","Nokia"]
print("list ກ່ອນການເພີ່ມ :\n", phone)      # \n ໃຊ້ເພື່ອໃຫ້ output ລົງແຖວໃໝ່ໃນຈຸດທີ່ເຮົາກຳນົດ

# ເພີ່ມດ້ວຍການໃຊ້ append
# ໂຄງສ້າງ : ໂຕແປ.append(ສະມາຊິກທີ່ຈະເພີ່ມ)
phone.append("Xiaomi")  # ເພີ່ມສະມາຊິກ Xiaomi ເຂົ້າໄປຕໍ່ທ້າຍໃນໂຕແປ phone
print("list ຫຼັງການເພີ່ມດ້ວຍ append :\n",phone)     # ສະແດງສະມາຊິກ phone ຫຼັງການເພີ່ມ

# ເພີ່ມດ້ວຍການໃຊ້ inser
# ໂຄງສ້າງ : ໂຕແປ.insert(index,ສະມາຊິກທີ່ຈະເພີ່ມ)
phone.insert(2,"Oppo")  # ເພີ່ມສະມາຊິກ Oppo ເຂົ້າໄປໃນຕຳແໜ່ງ index ທີ 2 ຂອງໂຕແປ phone
print("list ຫຼັງການເພີ່ມດ້ວຍ insert :\n",phone)      # ສະແດງສະມາຊິກ phone ຫຼັງການເພີ່ມ