'''
ການລົບສະມາຊິກອອກຈາກ list ສາມາດເຮັດໄດ້ 4 ແບບຄື:
1. remove ລົບສະມາຊິກທີ່ລະບຸອອກ
2. pop ລົບສະມາຊິກສຸດທ້າຍອອກ
3. del ລົບສະມາຊິກຕາມຕຳແໜ່ງ index
4. clear ລົບສະມາຊິກທັງໝົດໃນ list ອອກ ເຫຼືອແຕ່ list ເປົາ
'''

# list ຕັ້ງຕົ້ນ
phone = ["Samsung","Apple","Huawei","Nokia","Oppo","Realme","Vivo","Xiaomi"]
print("list ກ່ອນການລົບ :\n", phone)

# ລົບດ້ວຍຄຳສັ່ງ remove ຄືຈະຕ້ອງລະບຸວ່າສະມາຊິກໂຕໃດໃນ list ທີ່ຕ້ອງການລົບອອກ
phone.remove("Nokia")   # ໃຊ້ຄຳສັ່ງ .remove ພ້ອມລະບຸສະມາຊິກທີ່ຕ້ອງການລົບໃນ ()
print("list ຫຼັງການລົບດ້ວຍ remove :\n",phone)

# ລົບດ້ວຍຄຳສັ່ງ pop ຄືຈະລົບສະມາຊິກສຸດທ້າຍໃນ list ອອກ
phone.pop()   # ໃຊ້ຄຳສັ່ງ .pop ໂດຍບໍ່ຕ້ອງລະບຸສະມາຊິກໃນ () 
print("list ຫຼັງການລົບດ້ວຍ pop :\n",phone)

# ລົບດ້ວຍຄຳສັ່ງ del ຄືຈະລົບສະມາຊິກຕາມຕຳແໜ່ງ index 
# ແຕ່ຕ້ອງລະມັດລະວັງ ຕ້ອງໄດ້ມີການລະບຸ index ທຸກຄັ້ງ ຖ້າບໍ່ລະບຸມັນຈະເປັນການລົບ list ອອກ
del phone [2]   # ໃຊ້ຄຳສັ່ງ del ໂດຍຕ້ອງລະບຸ index ຂອງສະມາຊິກທີ່ຕ້ອງການລົບໃນ [] 
print("list ຫຼັງການລົບດ້ວຍ del :\n",phone)

# ລົບດ້ວຍຄຳສັ່ງ clear ຄືຈະລົບສະມາຊິກທັງໝົດໃນ list ອອກ ເຫຼືອແຕ່ list ເປົາ
phone.clear()   # ໃຊ້ຄຳສັ່ງ .clear ໂດຍບໍ່ຕ້ອງລະບຸສະມາຊິກໃນ () 
print("list ຫຼັງການລົບດ້ວຍ clear :\n",phone)