'''
Dictionary ຫຼື dict ເປັນໂຄງສ້າງຂໍ້ມູນແບບ non-primitive ມີລັກສະນະຄືກັນກັບ list, tuple ແລະ set
ຄືຈະເກັບຂໍ້ມູນແບບເປັນກຸ່ມ ເຊີ່ງຂໍ້ມູນຂ້າງໃນຈະເອີ້ນວ່າ ສະມາຊິກ ເຊີ່ງສາມາດຈັດກັບໄດ້ຫຼາຍໆ ປະເພດຂໍ້ມູນຮ່ວມກັນ
ແຕ່ຂໍ້ແຕກຕ່າງຈາກ list ກໍ່ຄືຂໍ້ມູນສະມາຊິກຈະບໍ່ສາມາດມີຄ່າຊ້ຳກັນ ແລະ ບໍ່ສາມາດແກ້ໄຂຂໍ້ມູນໄດ້ ເນື່ອງຈາກບໍ່ມີ index ໃນການອ້າງອິງ ແລະ ລຳດັບບໍ່ແນ່ນອນ
ແຕ່ເຮົາສາມາດສ້າງ index ດ້ວຍຕົນເອງໄດ້ ທີ່ເອີ້ນວ່າ key

'''
# ການສ້າງ dict ແມ່ນຈະໃຊ້ເຄື່ອງໝາຍ {} ໃນການກຳນົດຂອບເຂດ
# ໂຄງສ້າງຂອງມັນແມ່ນ 
# variable = {key : value}

# ເຮົາຕ້ອງການເກັບຂໍ້ມູນນັກສຶກສາ ໂດຍໃຫ້ມີການຈັບຄູ່ ລະຫັດ ແລະ ຊື່ນາມສະກຸນ
students = {"0001":"ທ້າວ ວັນນາ ສຸກກະພອນ", "0002":"ນາງ ລັດສະໝີ ພອນສີ", "0003":"ທ້າວ ສຸກແກ້ວ ທຳມະວັນ", "0004":"ນາງ ສີລະວັນ ທອງເສນາ"}

# ເມື່ອເຮົາຕ້ອງການກວດສອບສະມາຊິກວ່າມັນມີຄ່າຫຍັງໃຫ້ຄົ້ນຫາຈາກ key
print(students["0002"])

# ຫຼື ສາມາດໃຊ້ຄຳສັ່ງ get ກໍ່ໄດ້
print(students.get("0004"))

# ແຕ່ຖ້າສີ່ງທີ່ເຮົາຄົ້ນຫາບໍ່ມີໃນສະມາຊິກມັນກໍ່ຈະສະແດງເປັນ None