students = {"0001":"ທ້າວ ວັນນາ ສຸກກະພອນ", "0002":"ນາງ ລັດສະໝີ ພອນສີ", "0003":"ທ້າວ ສຸກແກ້ວ ທຳມະວັນ", "0004":"ນາງ ສີລະວັນ ທອງເສນາ"}

# loop ໃນ dict ມັນຈະສະແດງສະເພາະຄ່າທີ່ເປັນ key ເທົ່ານັ້ນ
for i in students:      
    print(i)     

# ແຕ່ຖ້າຕ້ອງການໃຫ້ມັນສະແດງ value ຕ້ອງໃຊ້ຄຳສັ່ງ .value ທີ່ range
for i in students.values():
    print(i)   

# ແຕ່ຖ້າຕ້ອງການໃຫ້ສະແດງທັງ 2 ຄ່າຕ້ອງກຳນົດໂຕແປມາ 2 ໂຕເພື່ອໃຊ້ບອກຕຳແໜ່ງແຕ່ລະຄ່າ ແລະໃຊ້ໃຊ້ຄຳສັ່ງ .items
for x,y in students.items():
    print(x, " = ", y)