'''
ການລົບສະມາຊິກອອກຈາກ dict ສາມາດເຮັດໄດ້ 2 ແບບຄື:
1. pop ລົບສະມາຊິກທີ່ລະບຸອອກ ໂດຍຕ້ອງລະບຸ key
2. popitem ລົບສະມາຊິກທີ່ຢູ່ຕຳແໜ່ງຫຼ່າສູດທີ່ຖືກເພີ່ມ ຫຼື ຕຳແໜ່ງສຸດທ້າຍອອກໄປ
3. clear ລົບສະມາຊິກທັງໝົດໃນ dict ອອກ ເຫຼືອແຕ່ dict ເປົາ
4. del ລົບ dict ແລະ ຄືນພື້ນທີ່ໜ່ວຍຄວາມຈຳ

'''
students = {"0001":"ທ້າວ ວັນນາ ສຸກກະພອນ", "0002":"ນາງ ລັດສະໝີ ພອນສີ", "0003":"ທ້າວ ສຸກແກ້ວ ທຳມະວັນ", "0004":"ນາງ ສີລະວັນ ທອງເສນາ"}
print("ກ່ອນລົບດ້ວຍ pop => ", students)

# 1. ໃຊ້ຄຳສັ່ງ pop ເພື່ອລົບຂໍ້ມູນທີ່ຕ້ອງການ ໂດຍການລະບຸ key ທີ່ຕ້ອງການລົບລົງໄປ
students.pop("0003")
print("ຫຼັງລົບດ້ວຍ pop => ", students)

# 2. ໃຊ້ຄຳສັ່ງ popitem ເພື່ອລົບສະມາຊິກທີ່ຢູ່ຕຳແໜ່ງຫຼ່າສູດທີ່ຖືກເພີ່ມ ຫຼື ຕຳແໜ່ງສຸດທ້າຍອອກໄປ
students.popitem()
print("ຫຼັງລົບດ້ວຍ popitem => ", students)

# 3. ລົບດ້ວຍຄຳສັ່ງ clear ຄືຈະລົບສະມາຊິກທັງໝົດໃນ dict ອອກ ເຫຼືອແຕ່ dict ເປົາ
students.clear()
print("ຫຼັງລົບດ້ວຍ clear => ",students)

# 4. ລົບດ້ວຍຄຳສັ່ງ del ຄືຈະລົບ dict ອອກ
del students 